app/Controllers/User.php

SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `role_user` ON `users`.`id_user` = `role_user`.`id_user`
---
    public function index()
    {
        $numPage = 5;
        $currentPage = $this->request->getVar('page_users') ? $this->request->getVar('page_users') : 1;

        // d($this->request->getVar('keyword'));

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $user = $this->usermodel->search($keyword);
        } else {
            $user = $this->usermodel->getUser();
        }

        $data = [
            'title' => 'User | Duren Marsekal',
            'nav' => 'user',
            'numpage' => $numPage,
            'list_user' => $user->paginate($numPage, 'users'),

UPDATE `users` SET `nama` = 'Rahman Yulianto', `username` = 'nick', `id_user` = '2', `password` = 'romadhoni12345'
WHERE `users`.`id` IN ('13')
---
            return redirect()->to('/user/edit/' . $id)->withInput()->with('validation', $validation);
        }

        $this->usermodel->save([
            'id' => $id,
            'nama' => $this->request->getVar('nama'),
            'username' => $this->request->getVar('username'),
            'id_user' => $this->request->getVar('role'),
            'password' => $this->request->getVar('password'),
        ]);