app/Models/DashboardModel.php

SELECT COUNT(*) AS `numrows` FROM `nama_durian`
---
    public function countAllPohon()
    {
        // $builder = $this->db->table('nama_durian');
        // $query = $builder->countAll();
        // return $query;

        return $this->table('nama_durian')->countAll();

SELECT *
FROM `nama_durian`
JOIN `update_durian` ON `nama_durian`.`id_durian` = `update_durian`.`id_durian`
---
    public function getDurianUpdate()
    {
        return $this->table('nama_durian')->join('update_durian', 'nama_durian.id_durian = update_durian.id_durian')->get();

SELECT COUNT(*) AS `numrows`
FROM `nama_durian`
JOIN `update_durian` ON `nama_durian`.`id_durian` = `update_durian`.`id_durian`
WHERE `status` LIKE '%sakit%' ESCAPE '!'
---
    public function getTanamanSakit()
    {
        $builder = $this
            ->table('nama_durian')
            ->join('update_durian', 'nama_durian.id_durian = update_durian.id_durian')
            ->like('status', 'sakit');
        $query = $builder->countAllResults();