app/Models/UserModel.php

    public function countUser()
    {
        return $this->table('users')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `users`

    public function getUser()
    {
        return $this->table('users')->select('id, nama, username, nama_user')->join('role_user', 'users.id_user = role_user.id_user');
---
SELECT `id`, `nama`, `username`, `nama_user`
FROM `users`
JOIN `role_user` ON `users`.`id_user` = `role_user`.`id_user`

    public function getUserWithPassword($id)
    {
        return $this->table('users')->where(['id' => $id])->join('role_user', 'users.id_user = role_user.id_user')->get();
---
SELECT *
FROM `users`
JOIN `role_user` ON `users`.`id_user` = `role_user`.`id_user`
WHERE `id` = '13'